test/artillery/loadtest_web.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 100
      name: "Ramping up the load"
    - duration: 120
      arrivalRate: 100
      rampTo: 300
      name: "Pushing a constant load"
scenarios:
  - flow:
    - log: "Call homepage"
    - get:
        url: "/"
        headers:
          X-Forwarded-For: "{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}"